04_Simulation/steadyState_2D_Baseline_RANS_kEpsilonPhitF/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          130;
        startFace       30950;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          130;
        startFace       31080;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       31210;
    }
    hills
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       31330;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          15600;
        startFace       31450;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          15600;
        startFace       47050;
    }
)

// ************************************************************************* //
